; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-3-5)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p0-3 - location
	p1-4 - location
	p2-0 - location
	p2-6 - location
	p3-2 - location
	p4-2 - location
	p4-3 - location
	p4-5 - location
	p6-2 - location
	p6-5 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s6)
	(at driver3 s4)
	(at driver4 s5)
	(at driver5 s6)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at package1 s1)
	(at package2 s6)
	(at package3 s0)
	(at package4 s0)
	(at package5 s6)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 36)
	(= (time-to-walk p0-1 s0) 36)
	(= (time-to-walk s1 p0-1) 79)
	(= (time-to-walk p0-1 s1) 79)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 50)
	(= (time-to-walk p0-3 s0) 50)
	(= (time-to-walk s3 p0-3) 16)
	(= (time-to-walk p0-3 s3) 16)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 67)
	(= (time-to-walk p1-4 s1) 67)
	(= (time-to-walk s4 p1-4) 21)
	(= (time-to-walk p1-4 s4) 21)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 76)
	(= (time-to-walk p2-0 s2) 76)
	(= (time-to-walk s0 p2-0) 8)
	(= (time-to-walk p2-0 s0) 8)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(= (time-to-walk s2 p2-6) 79)
	(= (time-to-walk p2-6 s2) 79)
	(= (time-to-walk s6 p2-6) 5)
	(= (time-to-walk p2-6 s6) 5)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 79)
	(= (time-to-walk p3-2 s3) 79)
	(= (time-to-walk s2 p3-2) 55)
	(= (time-to-walk p3-2 s2) 55)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 92)
	(= (time-to-walk p4-2 s4) 92)
	(= (time-to-walk s2 p4-2) 16)
	(= (time-to-walk p4-2 s2) 16)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 29)
	(= (time-to-walk p4-3 s4) 29)
	(= (time-to-walk s3 p4-3) 2)
	(= (time-to-walk p4-3 s3) 2)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 41)
	(= (time-to-walk p4-5 s4) 41)
	(= (time-to-walk s5 p4-5) 19)
	(= (time-to-walk p4-5 s5) 19)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(= (time-to-walk s6 p6-5) 27)
	(= (time-to-walk p6-5 s6) 27)
	(= (time-to-walk s5 p6-5) 27)
	(= (time-to-walk p6-5 s5) 27)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 71)
	(= (time-to-drive s1 s0) 71)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 93)
	(= (time-to-drive s2 s0) 93)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 28)
	(= (time-to-drive s4 s0) 28)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 20)
	(= (time-to-drive s6 s0) 20)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 62)
	(= (time-to-drive s3 s1) 62)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 41)
	(= (time-to-drive s6 s1) 41)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 62)
	(= (time-to-drive s5 s2) 62)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 95)
	(= (time-to-drive s6 s2) 95)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 28)
	(= (time-to-drive s2 s3) 28)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 66)
	(= (time-to-drive s4 s3) 66)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 57)
	(= (time-to-drive s6 s3) 57)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 64)
	(= (time-to-drive s0 s5) 64)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 45)
	(= (time-to-drive s4 s5) 45)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 6)
	(= (time-to-drive s4 s6) 6)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s4)
	(at driver3 s2)
	(at driver4 s6)
	(at driver5 s4)
	(at truck2 s5)
	(at package1 s6)
	(at package2 s3)
	(at package3 s3)
	(at package4 s2)
	(at package5 s0)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 1  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver3 truck2 s4)
   deleted: (at driver3 s4) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 0 of 10
2. (walk driver4 s5 p6-5)
   deleted: (at driver4 s5)
   added: (at driver4 p6-5)
   changed: (walked) from 0 to 27
   goals met: 0 of 10
3. (walk driver4 p6-5 s6)
   deleted: (at driver4 p6-5)
   added: (at driver4 s6)
   changed: (walked) from 27 to 54
   goals met: 1 of 10
4. (drive-truck truck2 s4 s6 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   changed: (driven) from 0 to 6
   goals met: 1 of 10
5. (load-truck package2 truck2 s6)
   deleted: (at package2 s6)
   added: (in package2 truck2)
   goals met: 1 of 10
6. (load-truck package5 truck2 s6)
   deleted: (at package5 s6)
   added: (in package5 truck2)
   goals met: 1 of 10
7. (drive-truck truck2 s6 s1 driver3)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (driven) from 6 to 47
   goals met: 1 of 10
8. (load-truck package1 truck2 s1)
   deleted: (at package1 s1)
   added: (in package1 truck2)
   goals met: 1 of 10
9. (drive-truck truck2 s1 s6 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   changed: (driven) from 47 to 88
   goals met: 1 of 10
10. (unload-truck package1 truck2 s6)
   deleted: (in package1 truck2)
   added: (at package1 s6)
   goals met: 2 of 10
11. (drive-truck truck2 s6 s3 driver3)
   deleted: (at truck2 s6)
   added: (at truck2 s3)
   changed: (driven) from 88 to 145
   goals met: 2 of 10
12. (unload-truck package2 truck2 s3)
   deleted: (in package2 truck2)
   added: (at package2 s3)
   goals met: 3 of 10
13. (drive-truck truck2 s3 s2 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (driven) from 145 to 173
   goals met: 3 of 10
14. (drive-truck truck2 s2 s0 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (driven) from 173 to 266
   goals met: 3 of 10
15. (unload-truck package5 truck2 s0)
   deleted: (in package5 truck2)
   added: (at package5 s0)
   goals met: 4 of 10
16. (load-truck package3 truck2 s0)
   deleted: (at package3 s0)
   added: (in package3 truck2)
   goals met: 4 of 10
17. (load-truck package4 truck2 s0)
   deleted: (at package4 s0)
   added: (in package4 truck2)
   goals met: 4 of 10
18. (drive-truck truck2 s0 s2 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (driven) from 266 to 359
   goals met: 4 of 10
19. (unload-truck package4 truck2 s2)
   deleted: (in package4 truck2)
   added: (at package4 s2)
   goals met: 5 of 10
20. (drive-truck truck2 s2 s3 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (driven) from 359 to 387
   goals met: 5 of 10
21. (unload-truck package3 truck2 s3)
   deleted: (in package3 truck2)
   added: (at package3 s3)
   goals met: 6 of 10
22. (drive-truck truck2 s3 s2 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (driven) from 387 to 415
   goals met: 6 of 10
23. (drive-truck truck2 s2 s5 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   changed: (driven) from 415 to 477
   goals met: 7 of 10
24. (walk driver5 s6 p6-5)
   deleted: (at driver5 s6)
   added: (at driver5 p6-5)
   changed: (walked) from 54 to 81
   goals met: 7 of 10
25. (walk driver5 p6-5 s5)
   deleted: (at driver5 p6-5)
   added: (at driver5 s5)
   changed: (walked) from 81 to 108
   goals met: 7 of 10
26. (walk driver5 s5 p4-5)
   deleted: (at driver5 s5)
   added: (at driver5 p4-5)
   changed: (walked) from 108 to 127
   goals met: 7 of 10
27. (walk driver5 p4-5 s4)
   deleted: (at driver5 p4-5)
   added: (at driver5 s4)
   changed: (walked) from 127 to 168
   goals met: 8 of 10
28. (walk driver2 s6 p6-5)
   deleted: (at driver2 s6)
   added: (at driver2 p6-5)
   changed: (walked) from 168 to 195
   goals met: 8 of 10
29. (disembark-truck driver3 truck2 s5)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 8 of 10
30. (walk driver2 p6-5 s5)
   deleted: (at driver2 p6-5)
   added: (at driver2 s5)
   changed: (walked) from 195 to 222
   goals met: 8 of 10
31. (board-truck driver2 truck2 s5)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 8 of 10
32. (drive-truck truck2 s5 s4 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (driven) from 477 to 522
   goals met: 7 of 10
33. (drive-truck truck2 s4 s3 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (driven) from 522 to 588
   goals met: 7 of 10
34. (walk driver3 s5 p4-5)
   deleted: (at driver3 s5)
   added: (at driver3 p4-5)
   changed: (walked) from 222 to 241
   goals met: 7 of 10
35. (drive-truck truck2 s3 s2 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (driven) from 588 to 616
   goals met: 7 of 10
36. (disembark-truck driver2 truck2 s2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s2) (empty truck2)
   goals met: 7 of 10
37. (walk driver2 s2 p4-2)
   deleted: (at driver2 s2)
   added: (at driver2 p4-2)
   changed: (walked) from 241 to 257
   goals met: 7 of 10
38. (walk driver2 p4-2 s4)
   deleted: (at driver2 p4-2)
   added: (at driver2 s4)
   changed: (walked) from 257 to 349
   goals met: 8 of 10
39. (walk driver4 s6 p2-6)
   deleted: (at driver4 s6)
   added: (at driver4 p2-6)
   changed: (walked) from 349 to 354
   goals met: 7 of 10
40. (walk driver3 p4-5 s4)
   deleted: (at driver3 p4-5)
   added: (at driver3 s4)
   changed: (walked) from 354 to 395
   goals met: 7 of 10
41. (walk driver4 p2-6 s2)
   deleted: (at driver4 p2-6)
   added: (at driver4 s2)
   changed: (walked) from 395 to 474
   goals met: 7 of 10
42. (board-truck driver4 truck2 s2)
   deleted: (at driver4 s2) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 7 of 10
43. (walk driver3 s4 p4-2)
   deleted: (at driver3 s4)
   added: (at driver3 p4-2)
   changed: (walked) from 474 to 566
   goals met: 7 of 10
44. (walk driver3 p4-2 s2)
   deleted: (at driver3 p4-2)
   added: (at driver3 s2)
   changed: (walked) from 566 to 582
   goals met: 8 of 10
45. (drive-truck truck2 s2 s5 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   changed: (driven) from 616 to 678
   goals met: 9 of 10
46. (disembark-truck driver4 truck2 s5)
   deleted: (driving driver4 truck2)
   added: (at driver4 s5) (empty truck2)
   goals met: 9 of 10
47. (walk driver4 s5 p6-5)
   deleted: (at driver4 s5)
   added: (at driver4 p6-5)
   changed: (walked) from 582 to 609
   goals met: 9 of 10
48. (walk driver4 p6-5 s6)
   deleted: (at driver4 p6-5)
   added: (at driver4 s6)
   changed: (walked) from 609 to 636
   goals met: 10 of 10
